Revit 2024 API
ForgeTypeId Class
 This class holds a string that uniquely identifies a Forge schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class ForgeTypeId : IDisposable
Visual Basic
Public Class ForgeTypeId _
	Implements IDisposable
Visual C++
public ref class ForgeTypeId : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ForgeTypeId
See Also
ForgeTypeId Members
Autodesk.Revit.DB Namespace